<?php


/*************************************************************

▼定数読み込み

**************************************************************/

require_once '../include/conf/const.php'; 

/*************************************************************

▼Model読み込み (Modelは、なんらかの処理をさせるディレクトリ)

**************************************************************/

require_once '../include/model/function.php'; 

/*************************************************************

▼変数の定義

**************************************************************/

$error = array();


/*************************************************************

▼関数を実行

**************************************************************/

$link = get_db_connect(); // DBに接続する関数 [返り値] : PDOオブジェクト

$data = get_goods_table_list($link); // SQLを実行して、結果セットを取得。連想配列として格納

if ($_SERVER['REQUEST_METHOD'] === 'POST'){

  $name = str_validation('user_name'); // Name属性を引数に渡す
  $comment = str_long_validation('user_comment');

  if(count($error) === 0){

    insert_table($link,$name,$comment);

  }
 
}


close_db_connect($link); // DBを切断


/*************************************************************

▼VIEW読み込み

**************************************************************/

include_once '../include/view/view.php'; 
