<?php

//index_controller
//result_contoroller
//tool_controller


/*************************************************************

▼MVCのルールに関して

**************************************************************/

/*

* VIEW - index_view.php,result_view.php,tool_view.php
* 表に出ないファイルは、MVCのどれに属しているかがわかるような、命名規則にする

* MODEL - index_model.php,tool_model.php
* 機能が同一の場合は、コントローラーは一緒にして良い。違う場合は別にするべし

* Contol - index.php,result.php,tool.php
* 表に出るファイルは、それらしい命名規則にした方がいいかな、という感じ


* 補足
* 一画面につき、１コントローラーというルールは、Swiftの実装でも採用されている

*/

/*************************************************************

▼設定ファイル読み込み

**************************************************************/

require_once '../include/conf/const.php';

/*************************************************************

▼Model読み込み

**************************************************************/

require_once '../include/model/function.php'; 

/*************************************************************

▼変数の定義

**************************************************************/

$error = array();


/*************************************************************

▼関数を実行

**************************************************************/

$link = get_db_connect(); // DBに接続する関数 [返り値] : PDOオブジェクト

$data = get_goods_table_list($link); // SQLを実行して、結果セットを取得。連想配列として格納

close_db_connect($link); // DBを切断


/*************************************************************

▼VIEW読み込み

**************************************************************/

include_once '../include/view/index_view.php';



