<?

session_start(); 

/*************************************************************

▼全体の処理の流れ [ログイン]

セッション開始
↓
POSTの値を取得する（EMAIL & PASS）
↓
EMAILの値を、クッキーに保存
↓
SQL実行（メールアドレス & PASSを条件に、ユーザーIDを取得する）
↓
ユーザーIDを変数に保存 & 確認
↓
ユーザーIDをセッションに保存
↓
ログイン済みページにリダイレクト



▼全体の処理の流れ [ユーザー登録]


POSTの値を取得する（EMAIL & PASS）
↓
SQL実行（メールアドレス & PASSを条件に、ユーザーIDを取得する）
↓
ユーザーIDを変数に保存 & 確認
↓
ユーザーIDをセッションに保存
↓
ログイン済みページにリダイレクト


**************************************************************/


/*************************************************************

▼設定ファイル読み込み

**************************************************************/

require_once '../include/conf/const.php';

/*************************************************************

▼Model読み込み

**************************************************************/

require_once '../include/model/function.php'; 

/*************************************************************

▼変数の定義

**************************************************************/

$error = array();

/*************************************************************

▼関数を実行

**************************************************************/


if ($_SERVER['REQUEST_METHOD'] === 'POST'){

  // バリデーション

  $name = str_validation('name'); 
  $mail = mail_validation('email'); 
  $passwd = str_validation('passwd'); 
  $passwd = md5($passwd); // 暗号化

  if(count($error) === 0){

    $link = get_db_connect();

    // 重複の確認

    confirm_name_exist($link,$name); // ユーザー名が重複してるかどうか確認
    confirm_address_exist($link,$mail); // アドレスが重複してるかどうか確認

    if(count($error) === 0){

      $_SESSION['login'] = TRUE;
      $_SESSION['name'] = $name; // セッションにユーザー名を保存

      insert_table($link,$name,$mail,$passwd); // クエリ実行

      // ログイン済みページへリダイレクト

      header('Location: http://'. $_SERVER['HTTP_HOST'] .'/24_cookie_session/login/htdocs/home.php'); 

    } 

  }

}

/*************************************************************

▼VIEW読み込み

**************************************************************/

include_once '../include/view/top_view.php';